/*****************************************************************************
 *
 * Name: 1_wechat_sends_red_envelope.c
 * Date: 2021/3/23
 * Author: shaozk <https://github.com/shaozk>
 *
 * 问题：
 * 微信发红包的问题，输入两个数m和n，分别表示要发的钱数以及红包总包数，
 * 然后输出每个人发到了多少钱。
 *
 * 输入格式：
 * 红包的总金额数
 * 人数
 *
 * 输出格式：
 * 每个人抢到的金额
 *
 * 输入样例：
 * 5.2
 * 4
 *
 * 输出样例：
 * 0.85 1.74 0.24 2.37
 *
 *****************************************************************************/

#include <stdio.h>

void send_red(float m, int n) {

}

int main() {
    float m;
    int n;
    scanf("%f %d", &m, &n);

    return 0;
}


