/*****************************************************************************
 *
 * Name: 12_find_the_main_element_sq.c
 * Date: 2021/3/14
 * Author: shaozk <https://github.com/shaozk>
 *
 * 题目：
 * 12.【2013统考真题】已知一个整数序列A=（a0,a1,...,an-1）其中0<=ai<=n(0<=i<n）若
 * 存在ap1=ap2=apm=x其m>n/2（0<=pk<n,1<=k<=m）,则称x为A的主元素。例如A=（0,5,3,5,7,5,5）
 * 则5为主元素：又如A=(1,5,,5,3,5,1,5,7),则A中没有主元素。假设A中的n个元素保存在一个一
 * 维数组中，请设计一个尽可能高效的算法，找出A的主元素。若存在主元素，则输出该元素；否则输出-1.
 * 要求：
 * 1）给出算法的基本设计思想
 * 2）根据设计思想，采用C或C++或Java语言描述算法，关键之外给出注释；
 * 3）说明你所设计的算法的时间复杂度和空间复杂度。
 *
 * 思路：
 *
 *****************************************************************************/
